Autodesk.Revit.DB.ConnectionResolution
Since:
2016
An enumerated type listing all the possible resolutions for connectivity validation.
Since:
2016

Autodesk.Revit.DB.ConnectionResolution.Disconnected
Value for parts were disconnected.